template_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-6 -6 0.1)
    (10 -6 0.1)
    (10  6 0.1)
    (-6  6 0.1)
    (-6 -6 0.15)
    (10 -6 0.15)
    (10  6 0.15)
    (-6  6 0.15)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (320 240 1) simpleGrading (1 1 1) // need 0.05 m length
);

edges
(
);

boundary
(
    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);


// ************************************************************************* //
