template_case/0.orig/gammaInt
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      gammaInt;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    "(outlet|upperWall|lowerWall)"
    {
        type            zeroGradient;
    }
    
    "(airfoil1|airfoil2|airfoil3)"
    {
        type            zeroGradient; // or fixedValue uniform 1; depending on OpenFOAM version
    }
    

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}