template_case/0.orig/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;            // 1% freestream turbulence intensity
        U               U;               // References the velocity field dynamically
        value           uniform 0.1; // Placeholder initialization value
    }
    "(outlet|upperWall|lowerWall)"
    {
        type            zeroGradient;
    }
    
    "(airfoil1|airfoil2|airfoil3)"
    {
        type            kLowReWallFunction; // CRITICAL: Do not use standard wall functions!
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}