template_case/system/changeDictionaryDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object changeDictionaryDict;
}

boundary
{
    frontAndBack
    {
        type    empty;
    }

}