template_case/system/snappyInclude/levels
eMeshLevel      4;

surfaceLevel    (3 4);

boxLevel        ((1 3));

surfaceLayers   5;