template_case/system/snappyInclude/y_plus
airfoil_1_firstLayer	1.9711352406228044e-05;
airfoil_2_firstLayer	5.928524715609595e-06;